Ran Plan for project: `crawlinghub-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role_policy_attachment.scheduler_sqs_access will be created
+ resource "aws_iam_role_policy_attachment" "scheduler_sqs_access" {
      + id         = (known after apply)
      + policy_arn = (sensitive value)
      + role       = "crawlinghub-scheduler-task-role-prod"
    }

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/crawlinghub-cluster-prod/crawlinghub-scheduler-prod"
        name                               = "crawlinghub-scheduler-prod"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS service for crawlinghub-scheduler-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "crawlinghub-scheduler-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "crawlinghub"
            "Service"     = "crawlinghub-scheduler"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-scheduler-prod:144" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-scheduler-prod:144" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-scheduler-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "crawlinghub-scheduler-prod" -> (known after apply)
      ~ revision                 = 144 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS task definition for crawlinghub-scheduler-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "crawlinghub-scheduler-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "crawlinghub"
            "Service"     = "crawlinghub-scheduler"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-scheduler-prod:144" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p crawlinghub-ecs-scheduler-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fecs-scheduler%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p crawlinghub-ecs-scheduler-prod
  ```
Plan: 2 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```